13/data/attachments/7a3433d7b855e432.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_d6d20aef-cbeb-4436-a67d-fa103779ff51</nif:username>
            <nif:friendToBeAdded>Scott_upon_Friend_11953_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>